Table of Contents
 Class RebarStirrupPattern
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a pattern of rebar
[OpenModelClass("CI.StructModel.Structure.RebarStirrupPattern,CI.StructuralElements", "CI.StructModel.Structure.IRebarStirrupPattern,CI.BasicTypes")]
public class RebarStirrupPattern : RebarPatternBase
Inheritance
object
OpenObject
OpenElementId
RebarPatternBase
RebarStirrupPattern
Inherited Members
 RebarPatternBase.Relative
 RebarPatternBase.StartPosition
 RebarPatternBase.EndPosition
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 RebarStirrupPattern()
create a new instance.
public RebarStirrupPattern()
Properties
 AddFirstStirrup
true: add first stirrup for this pattern. used do exclude the first stirrup in patterns > first.
public bool AddFirstStirrup { get; set; }
Property Value
bool
 Distance
Gets or sets the distance between rebars for this pattern.
public double Distance { get; set; }
Property Value
double
 Translation
Gets or sets the local eccentricity in X and Y direction apply transfotmation at 3D (section 3D) then transform to 3D.
public Vector3D Translation { get; set; }
Property Value
Vector3D
 Edit this page